#!/bin/bash

echo "===================================="
echo "СИСТЕМНАЯ ИНФОРМАЦИЯ"
echo "===================================="

echo "Текущий путь:"
echo "$PWD"
echo "------------------------------------"

echo "Текущая дата и время:"
date
echo "------------------------------------"

echo "Форматированная дата:"
echo "$(date +'%d.%m.%Y %H:%M:%S')"
echo "------------------------------------"

echo "Переменная PATH:"
echo "$PATH"
echo "------------------------------------"

echo "PATH:"
echo "$PATH" | tr ':' '\n'
echo "===================================="

echo "Количество директорий в PATH:"
echo "$PATH" | tr ':' '\n' | wc -l
echo "===================================="